Revit 2026 API

# AnalysisDisplayLegendSettings Class

---

Contains legend settings for analysis display style element.

SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayLegendSettings

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalysisDisplayLegendSettings : IDisposable
```
```vb
Public Class AnalysisDisplayLegendSettings
	Implements IDisposable
```
```cpp
public ref class AnalysisDisplayLegendSettings : IDisposable
```
```fsharp
type AnalysisDisplayLegendSettings =
    class
        interface IDisposable
    end
```

The AnalysisDisplayLegendSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayLegendSettings | Constructs a default instance of legend settings. |
|  | AnalysisDisplayLegendSettings(AnalysisDisplayLegendSettings) | Constructs a new copy of the input AnalysisDisplayLegendSettings object. |

|  | Name | Description |
| --- | --- | --- |
|  | ColorRangeHeight | Height of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units. |
|  | ColorRangeWidth | Width of color range (for Colored Surface, Markers and Text, and Vector display). Measured in paperspace units. |
|  | HeadingTextTypeId | Element id of text associated with legend heading. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberForScale | A fixed value to display on the legend scale (0 by default; 0 means width of legend scale is calculated dynamically). |
|  | NumberOfSteps | Number of steps (values between minimum and maximum) to be shown in legend. |
|  | Rounding | Rounding increment for numeric values of analysis results. |
|  | ScaleHeight | Height of scale (for Diagram display). Measured in paperspace units. |
|  | ShowDataDescription | If true, data description is shown in the legend. |
|  | ShowDataName | If true, data name is shown in the legend. |
|  | ShowLegend | If true, legend is shown in the view. |
|  | ShowUnits | If true, units are shown in the legend. |
|  | TextTypeId | Element id of text associated with legend body. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalysisDisplayLegendSettings |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Compares two legend settings objects. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Analysis Namespace